{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "distil-whisper/distil-small.en",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.08899690296270608,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.decoder.layers.1.q_proj",
    "model.decoder.layers.4.fc2",
    "model.decoder.layers.3.q_proj",
    "model.decoder.layers.5.fc1",
    "model.decoder.layers.0.q_proj",
    "model.decoder.layers.1.fc2",
    "model.decoder.layers.2.fc2",
    "model.decoder.layers.0.v_proj",
    "model.decoder.layers.5.fc2",
    "model.decoder.layers.0.fc2",
    "model.decoder.layers.3.out_proj",
    "model.decoder.layers.5.q_proj",
    "model.decoder.layers.5.k_proj",
    "model.decoder.layers.4.k_proj",
    "model.decoder.layers.0.out_proj",
    "model.decoder.layers.2.fc1",
    "model.decoder.layers.1.out_proj",
    "model.decoder.layers.4.v_proj",
    "model.decoder.layers.1.v_proj",
    "model.decoder.layers.3.v_proj",
    "model.decoder.layers.1.fc1",
    "model.decoder.layers.3.fc1",
    "model.decoder.layers.5.v_proj",
    "model.decoder.layers.1.k_proj",
    "model.decoder.layers.5.out_proj",
    "model.decoder.layers.4.q_proj",
    "model.decoder.layers.4.fc1",
    "model.decoder.layers.2.out_proj",
    "model.decoder.layers.0.fc1",
    "model.decoder.layers.3.fc2",
    "model.decoder.layers.2.q_proj",
    "model.decoder.layers.0.k_proj",
    "model.decoder.layers.2.v_proj",
    "model.decoder.layers.3.k_proj",
    "model.decoder.layers.4.out_proj",
    "model.decoder.layers.2.k_proj"
  ],
  "task_type": "SEQ_2_SEQ_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}